{
    "page1_img1.jpeg": "Cover image of the CUPRA Tavascan Owner's Manual, showing the front exterior of the vehicle.",
    "page7_img1.png": "Image of a QR code for accessing the digital owner's manual online. The text explains accessing the manual via QR, website, or the infotainment system.",
    "page8_img1.jpeg": "Diagram showing the front exterior view of the vehicle, highlighting locations of driving assistance sensors (radar, cameras, parking sensors), fluid check points (brake fluid, battery), front compartment access, and the front towing anchorage point.",
    "page9_img1.jpeg": "Diagram showing the rear exterior view of the vehicle, highlighting locations of the rear view camera, parking sensors, rear radars, rear lid, rear towing anchorage point, charging socket, and door access points (central locking, emergency lock).",
    "page10_img1.jpeg": "Diagram showing an interior view of the vehicle, highlighting the armrest, Isofix anchors, seat belts, seat adjustment controls, drink holder/emergency starter housing, start button, Connectivity Box/Wireless Charger, glove compartment, and front passenger airbag location/disconnection point.",
    "page11_img1.jpeg": "Diagram showing the driver's area overview for a left-hand drive vehicle. Highlights controls on the door panel (locking, mirrors, windows), dashboard (lights, Digital Cockpit, Infotainment, bonnet release, fuses), steering wheel (multifunction controls, airbag, adjustment), steering column levers (indicators, wipers), and center console (gear selector, parking brake).",
    "page12_img1.jpeg": "Diagram showing the driver's area overview for a right-hand drive vehicle. Highlights controls on the door panel (locking, mirrors, windows), dashboard (lights, Digital Cockpit, Infotainment, bonnet release, fuses), steering wheel (multifunction controls, airbag, adjustment), steering column levers (indicators, wipers), and center console (gear selector, parking brake).",
    "page17_img1.jpeg": "Image displaying the Digital Cockpit (instrument cluster) located on the dashboard behind the steering wheel. The text describes the different available display views and information profiles.",
    "page18_img1.png": "Diagram illustrating the battery state of charge and range display on the Digital Cockpit, including the visual representation for different reserve levels (yellow and red warnings).",
    "page19_img1.png": "Diagram illustrating the power display on the Digital Cockpit, showing available electric motor power (blue segment), brake energy recuperation availability (green segment), and current power usage/regeneration (lighter colored bar).",
    "page20_img1.jpeg": "Illustration of the driver's field of view showing information projected by the Head-up Display (HUD), including the proximity display area and the augmented reality (AR) display area on the windscreen.",
    "page23_img1.png": "Image shows the symbol displayed on the instrument cluster for the Drowsiness Monitor system, which alerts the driver to potential fatigue.",
    "page26_img1.png": "Image shows the symbol displayed on the instrument cluster for the Driver Attention Monitor system, which alerts the driver to potential distraction based on operating inputs.",
    "page28_img1.png": "Example display on the instrument cluster showing a detected speed limit sign along with a generic additional sign, as part of the Road Sign Detection system.",
    "page30_img1.png": "Example display on the instrument cluster showing a flashing speed limit sign, indicating that the vehicle's current speed exceeds the detected limit (Speed Warning function).",
    "page33_img1.png": "Schematic overview of the Infotainment system screen layout, identifying areas such as the top status bar, main menu display modes, customizable shortcuts, Climabar (climate controls), and control center access.",
    "page34_img1.png": "Schematic representation of the Infotainment system's initial configuration wizard screen, offering options for basic and advanced setup.",
    "page35_img1.jpeg": "Screenshot of the Infotainment system menu for accessing settings related to Driver Assistance systems (like Parking, ACC, Lane Assist, Front Assist) and Vehicle settings (like Lighting, Mirrors, Windows, Tyres).",
    "page37_img1.png": "Schematic representation of the Vehicle Information menu in the Infotainment system, showing access points for vehicle status (warnings, service info), driving data (consumption, range), and settings.",
    "page38_img1.png": "Schematic representation of the Departure Menu displayed on the Infotainment system after switching off the ignition, offering shortcuts to functions like charging, stationary air conditioning, and interior monitoring.",
    "page40_img1.png": "Diagrams illustrating the correct seating position for the driver, emphasizing minimum distance from the steering wheel (airbag) and correct alignment of the seat belt and headrest for optimal safety.",
    "page40_img2.png": "Diagrams illustrating the correct seating position for the driver, emphasizing minimum distance from the steering wheel (airbag) and correct alignment of the seat belt and headrest for optimal safety.",
    "page42_img1.jpeg": "Illustration showing how a properly fastened seat belt restrains the driver during sudden braking, preventing them from being thrown forward.",
    "page44_img1.png": "Image of the instrument cluster display showing the seat belt status indicator for vehicle occupants (grey=unoccupied, green=belted, red=unbelted).",
    "page44_img2.jpeg": "Diagrams illustrating the dangerous forward momentum of unbelted occupants (driver and rear passenger) during a head-on collision, emphasizing the importance of wearing seat belts.",
    "page44_img3.jpeg": "Diagrams illustrating the dangerous forward momentum of unbelted occupants (driver and rear passenger) during a head-on collision, emphasizing the importance of wearing seat belts.",
    "page45_img1.jpeg": "Illustrations demonstrating how to fasten the seat belt by inserting the latch plate into the buckle, and how to unfasten it by pressing the red release button.",
    "page45_img2.jpeg": "Illustrations demonstrating how to fasten the seat belt by inserting the latch plate into the buckle, and how to unfasten it by pressing the red release button.",
    "page46_img1.png": "Diagrams illustrating the correct positioning of the seat belt across the occupant's body, showing the shoulder strap centered on the shoulder and the lap strap across the pelvis. Includes guidance for pregnant occupants.",
    "page46_img2.jpeg": "Diagrams illustrating the correct positioning of the seat belt across the occupant's body, showing the shoulder strap centered on the shoulder and the lap strap across the pelvis. Includes guidance for pregnant occupants.",
    "page47_img1.jpeg": "Illustration showing the seat belt height adjuster located on the B-pillar for the front seats, used to position the shoulder strap correctly across the occupant's shoulder.",
    "page53_img1.jpeg": "Illustrations showing the location of the driver's front airbag module in the steering wheel hub and the front passenger airbag module in the dashboard.",
    "page53_img2.jpeg": "Illustrations showing the location of the driver's front airbag module in the steering wheel hub and the front passenger airbag module in the dashboard.",
    "page54_img1.jpeg": "Images showing the key-operated switch for manually deactivating/activating the front passenger airbag and the corresponding 'PASSENGER AIR BAG OFF' indicator lamp located on the roof console.",
    "page54_img2.png": "Images showing the key-operated switch for manually deactivating/activating the front passenger airbag and the corresponding 'PASSENGER AIR BAG OFF' indicator lamp located on the roof console.",
    "page55_img1.jpeg": "Illustrations showing the location of the central airbag module in the inboard side bolster of the driver's seat backrest and its deployment zone between the front occupants.",
    "page55_img2.jpeg": "Illustrations showing the location of the central airbag module in the inboard side bolster of the driver's seat backrest and its deployment zone between the front occupants.",
    "page56_img1.jpeg": "Illustrations showing the location of the side airbag modules within the outboard side bolsters of the front seat backrests and illustrating their deployment alongside the occupant.",
    "page56_img2.jpeg": "Illustrations showing the location of the side airbag modules within the outboard side bolsters of the front seat backrests and illustrating their deployment alongside the occupant.",
    "page57_img1.png": "Diagram showing the location of the head-protection (curtain) airbags along the roofline, above the side doors, and illustrating their deployment zone covering the window area.",
    "page59_img1.jpeg": "Image showing examples of different types of child restraint seats corresponding to various age/weight groups.",
    "page60_img1.png": "Images of the airbag warning labels located on the passenger-side sun visor and door frame, warning against using rear-facing child seats on the front seat unless the airbag is deactivated.",
    "page60_img2.png": "Images of the airbag warning labels located on the passenger-side sun visor and door frame, warning against using rear-facing child seats on the front seat unless the airbag is deactivated.",
    "page64_img1.png": "Illustrations showing the location of ISOFIX or i-Size anchor points (metal rings usually found between the seat cushion and backrest) in the rear and potentially front passenger seats, and demonstrating the attachment of a child seat's connectors.",
    "page64_img2.png": "Illustrations showing the location of ISOFIX or i-Size anchor points (metal rings usually found between the seat cushion and backrest) in the rear and potentially front passenger seats, and demonstrating the attachment of a child seat's connectors.",
    "page64_img3.jpeg": "Illustrations showing the location of ISOFIX or i-Size anchor points (metal rings usually found between the seat cushion and backrest) in the rear and potentially front passenger seats, and demonstrating the attachment of a child seat's connectors.",
    "page65_img1.png": "Illustrations showing the location of Top Tether anchor points (marked with an anchor symbol) on the back of the rear seat backrests (or potentially front passenger seat), and demonstrating how to route and attach the Top Tether strap from a child seat.",
    "page65_img2.png": "Illustrations showing the location of Top Tether anchor points (marked with an anchor symbol) on the back of the rear seat backrests (or potentially front passenger seat), and demonstrating how to route and attach the Top Tether strap from a child seat.",
    "page65_img3.jpeg": "Illustrations showing the location of Top Tether anchor points (marked with an anchor symbol) on the back of the rear seat backrests (or potentially front passenger seat), and demonstrating how to route and attach the Top Tether strap from a child seat.",
    "page66_img1.jpeg": "Illustration demonstrating how to install a child seat using the vehicle's 3-point seat belt by correctly routing the belt through the designated guides on the child seat.",
    "page68_img1.jpeg": "Image showing the location of the hazard warning lights switch (red triangle symbol) on the center console/dashboard.",
    "page68_img2.jpeg": "Image relates to the hazard warning lights function, used to alert other drivers in emergencies. Button located on center console.",
    "page70_img1.jpeg": "Illustration showing the vehicle's bonnet (hood) in the raised position after activation of the 'Active bonnet' pedestrian protection system.",
    "page70_img2.png": "Image showing the buttons located on the overhead console used for initiating Information calls (i), Assistance/Breakdown calls (wrench), and Emergency SOS calls.",
    "page71_img1.png": "Close-up view of the dedicated SOS Emergency call button located under a protective cover on the overhead console.",
    "page76_img1.png": "Illustrations of various warning labels found on or near high-voltage components, indicating risks such as electric shock, hot surfaces, corrosive/flammable battery contents, and advising caution/reading the manual.",
    "page76_img2.png": "Illustrations of various warning labels found on or near high-voltage components, indicating risks such as electric shock, hot surfaces, corrosive/flammable battery contents, and advising caution/reading the manual.",
    "page76_img3.png": "Illustrations of various warning labels found on or near high-voltage components, indicating risks such as electric shock, hot surfaces, corrosive/flammable battery contents, and advising caution/reading the manual.",
    "page76_img4.png": "Illustrations of various warning labels found on or near high-voltage components, indicating risks such as electric shock, hot surfaces, corrosive/flammable battery contents, and advising caution/reading the manual.",
    "page79_img1.png": "Standardized labels (EN 17186) used on the vehicle's charge port and charging infrastructure to indicate compatibility for AC charging (Type 2 connector) and DC fast charging (CCS connector).",
    "page79_img2.png": "Standardized labels (EN 17186) used on the vehicle's charge port and charging infrastructure to indicate compatibility for AC charging (Type 2 connector) and DC fast charging (CCS connector).",
    "page80_img1.jpeg": "Images showing how to open the vehicle's charging port cover and detailing the AC (Type 2) charging socket and its adjacent LED status indicator, used for alternating current charging.",
    "page80_img2.jpeg": "Images showing how to open the vehicle's charging port cover and detailing the AC (Type 2) charging socket and its adjacent LED status indicator, used for alternating current charging.",
    "page81_img1.jpeg": "Images showing how to open the vehicle's charging port cover and detailing the CCS charging socket (used for DC fast charging), its LED status indicator, and the removal of the protective cap covering the lower DC pins.",
    "page81_img2.jpeg": "Images showing how to open the vehicle's charging port cover and detailing the CCS charging socket (used for DC fast charging), its LED status indicator, and the removal of the protective cap covering the lower DC pins.",
    "page82_img1.jpeg": "Close-up of the LED indicator light next to the vehicle's charging socket, along with the explanatory sticker (typically located inside the charging flap) that details the meaning of the various light colors and patterns indicating charging status.",
    "page82_img2.png": "Close-up of the LED indicator light next to the vehicle's charging socket, along with the explanatory sticker (typically located inside the charging flap) that details the meaning of the various light colors and patterns indicating charging status.",
    "page85_img1.jpeg": "Images showing the access cover in the luggage compartment trim and the location of the manual emergency release loop used to unlock the charging connector if it becomes stuck.",
    "page85_img2.jpeg": "Images showing the access cover in the luggage compartment trim and the location of the manual emergency release loop used to unlock the charging connector if it becomes stuck.",
    "page87_img1.png": "Overview of the main charging settings menu in the Infotainment system, displaying current state of charge, range, charging power, and providing controls for setting charge limits, scheduling, and accessing further options.",
    "page94_img1.png": "Image of the vehicle's remote control key fob, identifying the buttons for unlocking, locking, unlocking the rear lid only, and the function indicator LED.",
    "page95_img1.png": "Diagram showing how to release and remove the mechanical key blade housed within the remote control key fob.",
    "page95_img2.png": "Diagrams illustrating the process of changing the battery in the remote control key fob, showing how to open the cover and remove the battery.",
    "page95_img3.png": "Diagrams illustrating the process of changing the battery in the remote control key fob, showing how to open the cover and remove the battery.",
    "page96_img1.png": "Diagram showing the approximate proximity detection zones around the vehicle for the Keyless Access system.",
    "page97_img1.jpeg": "Close-up of an exterior door handle showing the sensor surface on the outside for locking (B) and the sensor surface on the inside for unlocking (A) with the Keyless Access system.",
    "page100_img1.png": "Image of the remote control key fob highlighting the lock and unlock buttons used for operating the central locking system.",
    "page101_img1.jpeg": "Image showing the location of the central locking button on the driver's interior door panel, used for locking/unlocking all doors from inside.",
    "page105_img1.jpeg": "Illustrations showing how to remove the cover cap from the driver's door handle using the key blade to access the hidden mechanical lock cylinder for emergency locking/unlocking.",
    "page105_img2.jpeg": "Illustrations showing how to remove the cover cap from the driver's door handle using the key blade to access the hidden mechanical lock cylinder for emergency locking/unlocking.",
    "page105_img3.jpeg": "Illustrations showing how to remove the cover cap from the driver's door handle using the key blade to access the hidden mechanical lock cylinder for emergency locking/unlocking.",
    "page106_img1.jpeg": "Image showing the location of the manual emergency locking mechanism on the edge of a passenger or rear door, used for locking when central locking fails.",
    "page106_img2.jpeg": "Image showing the touch panel/button on the driver's door control area used to activate/deactivate the electric child safety locks for the rear doors and windows.",
    "page108_img1.jpeg": "Image showing the location of the exterior handle/release button used to open the rear lid manually or trigger the electric opening.",
    "page108_img2.jpeg": "Image showing the button on the driver's door panel used for electrically opening and closing the vehicle's rear lid.",
    "page108_img3.png": "Image showing the location of the button on the interior trim of the electric rear lid, used to initiate the automatic closing.",
    "page110_img1.jpeg": "Diagram illustrating the required foot kicking motion under the rear bumper to activate the sensor-controlled 'Easy Open' (Virtual Pedal) function for opening/closing the rear lid.",
    "page111_img1.png": "Image of the driver's door control panel showing the power window switches (1), the button to switch control between front/rear windows (2), and the child lock button for rear windows/doors (3).",
    "page114_img1.png": "Diagrams detailing the layout and functions of the controls on the multifunction steering wheel, including buttons/touchpads for volume, media, phone, voice control, driver assistance systems (ACC, Travel Assist, Lane Assist), and drive profile selection.",
    "page114_img2.png": "Diagrams detailing the layout and functions of the controls on the multifunction steering wheel, including buttons/touchpads for volume, media, phone, voice control, driver assistance systems (ACC, Travel Assist, Lane Assist), and drive profile selection.",
    "page115_img1.jpeg": "Image showing the location of the adjustment lever under the steering column, used to manually adjust the steering wheel's height and reach.",
    "page116_img1.png": "Diagram showing the locations of the levers and wheels for manual front seat adjustment, including fore/aft position (1), seat cushion angle (2, optional), height (3), and backrest angle (4).",
    "page117_img1.png": "Diagram showing the locations of the controls for electric front seat adjustment, including lumbar support (A), seat position/height/angle (B), and backrest angle (C).",
    "page117_img2.jpeg": "Image showing the release button/lever located on the top edge of the rear seat backrest, used to unlock and fold the backrest down.",
    "page119_img1.png": "Diagrams showing the mechanisms for adjusting the rear headrest height (using the side button) and for removing the headrest (using the side button and the safety release hole).",
    "page119_img2.png": "Diagrams showing the mechanisms for adjusting the rear headrest height (using the side button) and for removing the headrest (using the side button and the safety release hole).",
    "page120_img1.png": "Image showing the location of the memory buttons (SET, 1, 2, 3) on the side of the driver's seat, used to store and recall preferred seat and exterior mirror positions.",
    "page121_img1.jpeg": "Image of the front center armrest, showing the release button (1) used to open the underlying storage compartment.",
    "page121_img2.jpeg": "Image showing the folding rear center armrest located in the rear seat backrest, highlighting the pull cord used to deploy it.",
    "page122_img1.png": "Image of the main lighting control panel on the dashboard, showing the controls for selecting Dipped Beam, Automatic lights (AUTO), Side Lights, and activating Front/Rear Fog Lights.",
    "page124_img1.jpeg": "Image of the steering column lever used for activating right/left turn signals (1/2), main beam headlights (3), and the headlight flasher (4).",
    "page128_img1.jpeg": "Image of the front overhead console showing the controls for the interior lighting: main interior light off, door contact mode activation, and individual reading light activation.",
    "page129_img1.jpeg": "Schematic representation of the Infotainment system screen for controlling the interior ambient background lighting, allowing selection of profiles and adjustment of intensity/color.",
    "page130_img1.jpeg": "Image of the steering column lever (A) used for controlling the windscreen wipers (Off, Intermittent/Rain Sensor, Slow, Fast) and the washer button (1) for cleaning the windscreen.",
    "page131_img1.jpeg": "Image indicating the location of the sensitive surface for the rain and light sensor, typically mounted on the windscreen near the interior rearview mirror base.",
    "page133_img1.png": "Image of the rotary control knob on the driver's door panel used for selecting the left/right exterior mirror for adjustment, activating mirror heating, and folding the mirrors.",
    "page135_img1.png": "Illustration showing a front sun visor detached from its central clip and swung towards the side door (1), and with the vanity mirror cover opened (2).",
    "page135_img2.png": "Image showing the touch-sensitive function button/slider located on the overhead console used for opening and closing the electric sun blind for the glass roof.",
    "page139_img1.png": "Schematic overview of the 'Climabar' located at the bottom of the Infotainment screen, showing the touch controls for driver/passenger temperature, seat heating, windscreen defrost, main climate menu access, and rear window defrost.",
    "page140_img1.jpeg": "Schematic representation of the main Air Conditioning menu screen in the Infotainment system, showing controls for switching on/off, temperature synchronization (SYNC), air distribution modes, recirculation, heating/cooling functions, and fan speed.",
    "page141_img1.png": "Image of the control panel on the back of the center console for rear passengers, showing buttons for adjusting the rear climate zone temperature (1, 2) and activating left/right rear seat heating (3, 4).",
    "page143_img1.png": "Schematic representation of the Seats menu screen in the Infotainment system, showing the controls for adjusting the heating levels for front/rear seats and the ventilation levels for the front seats.",
    "page146_img1.jpeg": "Image showing the location of the windscreen humidity and temperature sensor, typically near the interior rearview mirror base, used for automatic climate control adjustments.",
    "page146_img2.jpeg": "Diagram showing the designated areas (indicated by arrows) on the windscreen, near the interior mirror, suitable for mounting electronic accessories like toll devices to minimize interference from the heated windscreen film.",
    "page156_img1.png": "Image showing the location of the ignition/start button used to switch the vehicle's ignition and drive system on or off.",
    "page160_img1.jpeg": "Image of the gear selector used to choose driving modes (D/B, N, R) and the adjacent electronic parking brake button (P).",
    "page161_img1.jpeg": "Image showing the paddle levers located behind the multifunction steering wheel, used for manually adjusting the level of brake energy recuperation.",
    "page164_img1.jpeg": "Image highlighting the dedicated 'DRIVE' and 'CUPRA' buttons on the multifunction steering wheel used for selecting and changing the vehicle's drive profiles.",
    "page172_img1.jpeg": "Image indicating the location of the front radar sensor, typically mounted in the lower front bumper or grille area, used for driver assistance systems like ACC and Front Assist.",
    "page173_img1.png": "Schematic diagram illustrating the approximate detection zone (range and angle) of the front radar sensor.",
    "page173_img2.jpeg": "Image showing the location of the front-facing camera mounted on the windscreen, usually behind the interior rearview mirror base, used for various driver assistance systems.",
    "page174_img1.jpeg": "Diagrams showing the approximate mounting locations of the rear radar sensors behind the rear bumper corners and illustrating their detection zones for monitoring areas behind and beside the vehicle.",
    "page174_img2.png": "Diagrams showing the approximate mounting locations of the rear radar sensors behind the rear bumper corners and illustrating their detection zones for monitoring areas behind and beside the vehicle.",
    "page175_img1.jpeg": "Image showing the location of the rear-view camera, typically mounted on the rear bumper near the license plate or on the rear lid.",
    "page177_img1.png": "Image highlighting the buttons on the multifunction steering wheel used to operate the conventional Cruise Control system (GRA): setting/resuming speed (RES/+), adjusting speed (-), cancelling (CANCEL), and accessing the assistants menu.",
    "page178_img1.png": "Image highlighting the buttons on the multifunction steering wheel used to operate the Speed Limiter function: setting/resuming (RES/+), adjusting speed (-), cancelling (CANCEL), and accessing the assistants menu.",
    "page181_img1.png": "Example display on the instrument cluster showing an Eco Assistance prompt, combining the 'foot off accelerator' symbol with an icon indicating an upcoming driving event (e.g., curve, speed limit, junction).",
    "page183_img1.png": "Images showing an example of the Adaptive Cruise Control (ACC) display on the instrument cluster (1: vehicle detected, 2: set distance) and highlighting the relevant operating buttons on the multifunction steering wheel.",
    "page183_img2.png": "Images showing an example of the Adaptive Cruise Control (ACC) display on the instrument cluster (1: vehicle detected, 2: set distance) and highlighting the relevant operating buttons on the multifunction steering wheel.",
    "page185_img1.png": "Example display on the instrument cluster showing the Adaptive Cruise Control (ACC) system detecting a vehicle in the adjacent left lane.",
    "page186_img1.png": "Diagrams illustrating specific scenarios where Adaptive Cruise Control (ACC) may have limitations, such as detecting vehicles on sharp curves, narrow vehicles like motorcycles, or vehicles cutting into the lane abruptly.",
    "page186_img2.png": "Diagrams illustrating specific scenarios where Adaptive Cruise Control (ACC) may have limitations, such as detecting vehicles on sharp curves, narrow vehicles like motorcycles, or vehicles cutting into the lane abruptly.",
    "page186_img3.png": "Diagrams illustrating specific scenarios where Adaptive Cruise Control (ACC) may have limitations, such as detecting vehicles on sharp curves, narrow vehicles like motorcycles, or vehicles cutting into the lane abruptly.",
    "page187_img1.png": "Diagram illustrating a limitation of Adaptive Cruise Control (ACC) where it may not detect or react to stationary objects or vehicles in the lane ahead.",
    "page194_img1.png": "Example display on the instrument cluster for the Lane Assist system, showing detected lane boundaries (white lines, 2) and indicating active steering intervention on one side (yellow line, 1).",
    "page196_img1.png": "Schematic example of the Travel Assist display on the instrument cluster, showing the status of adaptive lane guidance via lane marking color (1: green=active, grey=passive) and the set distance (2) for adaptive cruise control.",
    "page197_img1.png": "Representation of the Travel Assist display on the instrument cluster when utilizing supplementary online map data, indicated by triangular markers along the lane boundary (1).",
    "page198_img1.png": "Image highlighting the buttons on the left side of the multifunction steering wheel used to operate the Travel Assist system.",
    "page199_img1.png": "Schematic example of the instrument cluster display during an assisted lane change manoeuvre, showing the target lane (1) and status indicator arrows (2) within the current lane.",
    "page203_img1.jpeg": "Images showing the Side Assist (blind spot) warning indicator lamp located in the exterior mirror housing, illustrating its appearance when active (illuminated or flashing).",
    "page203_img2.jpeg": "Images showing the Side Assist (blind spot) warning indicator lamp located in the exterior mirror housing, illustrating its appearance when active (illuminated or flashing).",
    "page204_img1.jpeg": "Diagrams illustrating typical driving situations where the Side Assist system provides warnings, such as when being overtaken by another vehicle or when overtaking another vehicle.",
    "page204_img2.jpeg": "Diagrams illustrating typical driving situations where the Side Assist system provides warnings, such as when being overtaken by another vehicle or when overtaking another vehicle.",
    "page207_img1.jpeg": "Image showing the location of the electronic parking brake switch (P) typically found near the gear selector.",
    "page211_img1.png": "Example view of the Park Distance Control Plus (Park Pilot) graphical display on the Infotainment system screen, showing proximity segments around the vehicle.",
    "page214_img1.png": "Close-up of the Park Distance Control Plus display explaining the meaning of the colored segments (grey, yellow, red indicate proximity) and showing projected trajectory lines.",
    "page217_img1.png": "Image of the Infotainment system screen displaying icons for selecting different parking modes available with the Intelligent Park Assist (IPA) system.",
    "page218_img1.png": "Example displays on the Infotainment screen during parallel and perpendicular (bay) parking manoeuvres guided by the Intelligent Park Assist (IPA) system, showing the detected space (2), vehicle position (1), proposed manoeuvre (3), and Start button (4).",
    "page218_img2.png": "Example displays on the Infotainment screen during parallel and perpendicular (bay) parking manoeuvres guided by the Intelligent Park Assist (IPA) system, showing the detected space (2), vehicle position (1), proposed manoeuvre (3), and Start button (4).",
    "page219_img1.jpeg": "Example display of the Intelligent Park Assist (IPA) screen highlighting the progress bar (5), which indicates the remaining distance for the current parking manoeuvre step.",
    "page219_img2.png": "Example display of the Intelligent Park Assist (IPA) screen showing a detected parking space with side arrows, indicating potential alternative parking orientations within that space.",
    "page219_img3.png": "Example display on the Infotainment screen during the manoeuvre to exit a parallel parking space, guided by the Intelligent Park Assist (IPA) system, showing vehicle position (1), proposed path (2), and Start button (3).",
    "page223_img1.png": "Screenshots of the Automatic Parking System Plus with memory function menu in the Infotainment system, showing saved parking spaces (1, 2, 3), options to add/edit/delete, and status indicators.",
    "page223_img2.png": "Screenshots of the Automatic Parking System Plus with memory function menu in the Infotainment system, showing saved parking spaces (1, 2, 3), options to add/edit/delete, and status indicators.",
    "page224_img1.png": "Example of the saved parking spaces menu screen where some spaces display a navigation symbol, indicating they can be selected as a destination for the vehicle's navigation system.",
    "page233_img1.png": "Diagram illustrating the detection zone monitored by the Rear Cross Traffic Alert system when reversing, used to warn the driver of vehicles approaching from the sides.",
    "page234_img1.jpeg": "Illustration of the Exit Warning system detecting an approaching hazard (cyclist) as a door is opened, and showing the corresponding flashing warning lamp in the exterior mirror.",
    "page234_img2.jpeg": "Illustration of the Exit Warning system detecting an approaching hazard (cyclist) as a door is opened, and showing the corresponding flashing warning lamp in the exterior mirror.",
    "page236_img1.jpeg": "Image showing the glove compartment located on the passenger side of the dashboard, highlighting its opening handle.",
    "page237_img1.jpeg": "Image showing the drink holders integrated into the folding rear center armrest.",
    "page238_img1.png": "Diagram showing the locations of power outlets in the vehicle: 12V sockets in the front armrest/luggage compartment (1/2) and rear console (2), and rear USB charging ports (3).",
    "page247_img1.png": "Image of a QR code provided for downloading the My CUPRA App, used for registering and managing CUPRA CONNECT online services.",
    "page255_img1.jpeg": "Image showing the location of the front USB ports on the center console, used for charging and data connections (e.g., Full Link).",
    "page259_img1.png": "Overview diagram of the Infotainment system identifying the main controls: HOME button (1), MENU button (2), touch screen (3), On/Off touchpad (4), temperature touch zones (5), and volume touch zones (6).",
    "page268_img1.png": "Schematic representation of the main Radio mode screen in the Infotainment system, displaying the tuned station, frequency/reception type selection, preset favourite buttons, and other radio controls.",
    "page272_img1.png": "Schematic representation of the main Media mode screen in the Infotainment system, displaying current track/source information, playback controls, media source selection, and access to favourites/settings.",
    "page275_img1.jpeg": "Schematic representation of the main Navigation screen in the Infotainment system, showing the map display, destination search function, route options, and map view controls.",
    "page283_img1.png": "Schematic representation of the main Telephone interface screen in the Infotainment system, providing access to Contacts, Call lists, Dial pad, Text messages, and Settings.",
    "page287_img1.jpeg": "Image showing the 'Connectivity Box' pad located in the center console storage area, used for wireless mobile phone charging (Qi standard) and mobile signal amplification.",
    "page291_img1.jpeg": "Illustrations demonstrating the removal of the luggage compartment shelf by detaching support cords (A, B) and lifting it from side mounts, and the process for reinstallation.",
    "page291_img2.jpeg": "Illustrations demonstrating the removal of the luggage compartment shelf by detaching support cords (A, B) and lifting it from side mounts, and the process for reinstallation.",
    "page292_img1.jpeg": "Image showing the main luggage compartment floor panel, which can be lifted or folded to access storage space underneath.",
    "page292_img2.jpeg": "Illustrations showing the operation of the variable (two-level) luggage compartment floor, including lifting the panel (1) and securing it in a raised/vertical position using side brackets.",
    "page292_img3.jpeg": "Illustrations showing the operation of the variable (two-level) luggage compartment floor, including lifting the panel (1) and securing it in a raised/vertical position using side brackets.",
    "page293_img1.png": "Image showing the location of fastening rings (lashing points) in the luggage compartment, used for securing cargo.",
    "page293_img2.jpeg": "Image showing the location of retractable bag hooks on the side trim panels within the luggage compartment.",
    "page294_img1.jpeg": "Illustrations showing how to open the load-through trapdoor (ski hatch) located behind the rear center armrest, either from the passenger compartment (1) or the luggage compartment.",
    "page294_img2.jpeg": "Illustrations showing how to open the load-through trapdoor (ski hatch) located behind the rear center armrest, either from the passenger compartment (1) or the luggage compartment.",
    "page295_img1.jpeg": "Image showing the designated attachment points (1, 2) on the vehicle's roof frame (visible with doors open) for installing approved roof rack crossbars.",
    "page299_img1.png": "Diagram showing the standard pin assignment and functions for the vehicle's 13-pin trailer electrical socket.",
    "page303_img1.png": "Image showing the location of the button in the luggage compartment side trim used to electrically unlock the retractable/swiveling tow hitch.",
    "page304_img1.png": "Diagram illustrating the recommended weight distribution for a rear carrier system mounted on the tow hitch, advising to place heavier loads closer to the vehicle.",
    "page305_img1.jpeg": "Diagram defining the measurement for the maximum permissible load overhang on a rear carrier system, from the tow ball center (A/B) to the center of the last support rail.",
    "page305_img2.jpeg": "Technical diagrams showing key dimensions and attachment point locations for retrofitting an approved towing bracket to the vehicle.",
    "page305_img3.jpeg": "Technical diagrams showing key dimensions and attachment point locations for retrofitting an approved towing bracket to the vehicle.",
    "page307_img1.png": "Illustration indicating the storage location of the vehicle tool kit, typically found beneath the luggage compartment floor panel.",
    "page307_img2.jpeg": "Images showing the windscreen wipers in their raised 'service position' and the wiper control lever (1) used to activate this position for maintenance or blade replacement.",
    "page307_img3.jpeg": "Images showing the windscreen wipers in their raised 'service position' and the wiper control lever (1) used to activate this position for maintenance or blade replacement.",
    "page308_img1.png": "Diagram showing how to remove the windscreen wiper blade by pressing the release button (1) on the wiper arm and sliding the blade in the direction indicated.",
    "page309_img1.jpeg": "Image showing the location of the designated negative (-) jump start terminal (ground point) in the front compartment.",
    "page310_img1.png": "Diagram showing the correct connection sequence (1-4) for jump leads between the vehicle with the discharged battery (A) and the assisting vehicle (B).",
    "page313_img1.jpeg": "Illustrations showing how to remove the cover from the front bumper to access the attachment point, and how to screw in the removable front towing eye.",
    "page313_img2.jpeg": "Illustrations showing how to remove the cover from the front bumper to access the attachment point, and how to screw in the removable front towing eye.",
    "page314_img1.jpeg": "Illustrations showing how to remove the cover from the rear bumper to access the attachment point, and how to screw in the removable rear towing eye (for vehicles without a factory tow hitch).",
    "page314_img2.jpeg": "Illustrations showing how to remove the cover from the rear bumper to access the attachment point, and how to screw in the removable rear towing eye (for vehicles without a factory tow hitch).",
    "page316_img1.jpeg": "Images showing the location of the interior fuse box cover, either under the dashboard on the driver's side (LHD) or within the glove compartment (RHD).",
    "page316_img2.jpeg": "Images showing the location of the interior fuse box cover, either under the dashboard on the driver's side (LHD) or within the glove compartment (RHD).",
    "page317_img1.jpeg": "Image showing the location of the main fuse box cover (1) in the front compartment. May also contain fuse removal tweezers (2).",
    "page317_img2.png": "Illustration showing how to identify a blown blade fuse by observing the broken/melted internal metal strip.",
    "page323_img1.jpeg": "Illustrations showing the primary bonnet release lever (1) located in the driver's footwell area, and the secondary safety release latch (2) located under the front edge of the bonnet.",
    "page323_img2.jpeg": "Illustrations showing the primary bonnet release lever (1) located in the driver's footwell area, and the secondary safety release latch (2) located under the front edge of the bonnet.",
    "page325_img1.png": "Image showing the MIN/MAX markings on the side of the coolant expansion tank, used to check the correct coolant level.",
    "page326_img1.jpeg": "Image showing the cap of the coolant expansion tank located in the front compartment.",
    "page327_img1.png": "Image showing the cap of the brake fluid reservoir located in the front compartment.",
    "page328_img1.png": "Image showing the blue cap of the windscreen washer fluid reservoir located in the front compartment.",
    "page336_img1.jpeg": "Image showing the location of the tyre pressure information sticker, typically found on the driver's side door frame (B-pillar).",
    "page337_img1.png": "Close-up image of a tyre tread highlighting the Tread Wear Indicator (TWI) bars located within the grooves, used to gauge minimum legal tread depth.",
    "page338_img1.png": "Diagram illustrating a recommended pattern for rotating vehicle tyres to ensure even wear.",
    "page341_img1.jpeg": "Image showing the decorative/protective caps covering the wheel nuts and the plastic clip tool used for their removal.",
    "page341_img2.png": "Illustration showing an anti-theft wheel bolt and the keyed adapter (1) required for its removal and installation.",
    "page341_img3.jpeg": "Image demonstrating the process of loosening a wheel nut using a wheel wrench.",
    "page342_img1.jpeg": "Image showing the designated reinforcement points under the vehicle's side sill where the jack should be positioned for lifting.",
    "page342_img2.png": "Diagram illustrating the correct placement of the jack, with the jack head tab (1) engaged in the vehicle's support point and the base plate (2) firmly on the ground.",
    "page344_img1.png": "Image of the instrument cluster displaying the Tyre Pressure Monitoring System (TPMS) warning light, indicating low pressure or a system fault.",
    "page362_img1.png": "Images displaying various recycling and disposal symbols: the WEEE symbol (crossed-out bin) for electrical/electronic devices, and the French Triman logo and Info-tri symbols indicating sorting instructions for packaging and specific products.",
    "page362_img2.png": "Images displaying various recycling and disposal symbols: the WEEE symbol (crossed-out bin) for electrical/electronic devices, and the French Triman logo and Info-tri symbols indicating sorting instructions for packaging and specific products.",
    "page362_img3.png": "Images displaying various recycling and disposal symbols: the WEEE symbol (crossed-out bin) for electrical/electronic devices, and the French Triman logo and Info-tri symbols indicating sorting instructions for packaging and specific products.",
    "page362_img4.png": "Images displaying various recycling and disposal symbols: the WEEE symbol (crossed-out bin) for electrical/electronic devices, and the French Triman logo and Info-tri symbols indicating sorting instructions for packaging and specific products.",
    "page363_img1.png": "QR code linking to a website with environmental labeling and recycling information for packaging materials, specifically for the Italian market.",
    "page370_img1.jpeg": "Technical drawing illustrating the main exterior dimensions of the vehicle, including length (D), width (G), height (H), wheelbase (C), track width (E/F), and overhangs (A/B).",
    "page384_img1.jpeg": "Image of the back cover of the Tavascan Owner's Manual, displaying publication details like language, edition date, and part number."
  }